Repository: 363921219/nbd
Catalog: debian/po/*.po
Languages: nl

source: AUTO_GEN is set to "n" in /etc/nbd-client
nl: /etc/nbd-client heeft AUTO_GEN op "n" staan.

source: If that's wrong, remove the line and call "dpkg-reconfigure nbd-client" afterwards.
nl: Als dat een vergissing is, verwijder dan die lijn en roep daarna "dpkg-reconfigure nbd-client" aan.

source: Number of nbd-client connections to use:
nl: Hoeveel nbd-client verbindingen wenst U te gebruiken?

source: nbd-client can handle multiple concurrent connections. Please specify the number of connections you'd like this configuration script to set up.
nl: nbd-client kan verscheidene verbindingen tegelijkertijd afhandelen. Gelieve op te geven hoeveel verbindingen U door dit configuratiescript wilt laten configureren.

source: Note that if something has already been specified in /etc/nbd-client, the current configuration will be used as defaults in these dialogs.
nl: Merk op dat indien /etc/nbd-client reeds informatie bevat, dat dan de huidige configuratie als default gebruikt zal worden in deze dialoog.

source: swap, filesystem, raw
nl: swap, bestandssysteem, geen configuratie

source: Intended use of the network block device number ${number}:
nl: Waarvoor wil je het network block device gebruiken (nummer: ${number})?

source: The network block device can serve multiple purposes. One of the most interesting is to provide swap space over the network for diskless clients, but you can store a filesystem on it, or do other things with it for which a block device is interesting.
nl: Het network block device kan voor verschillende doelen gebruikt worden. Één van de meest interessante is om swapruimte via het netwerk aan te bieden aan computers zonder harde schijf, maar je kunt er ook een bestandssysteem op plaatsen, of er andere zaken mee doen waar een block device interessant voor kan zijn.

source: If you intend to use the network block device as a swap device, choose "swap". If you intend to use it as a filesystem, add a line to /etc/fstab, give it the option "_netdev" (else init will try to mount it before it's usable), and choose "filesystem". For all other purposes, choose "raw". The only thing the nbd-client boot script will do then is start an nbd-client process; you will have to set it up manually.
nl: Als je van plan bent om het als swapdevice te gebruiken, kies dan "swap". Ben je van plan om dit als bestandssysteem te gebruiken, voeg dan een lijn toe aan /etc/fstab, geef het de optie "_netdev" (als je dat niet doet dan zal init proberen het bestandssysteem te mounten voor dat mogelijk is), en kies "bestandssysteem". Voor alle andere doelen kies je "geen configuratie". Het enige dat het nbd-client bootscript dan zal doen is het starten van een nbd-client proces; je zult alle andere zaken manueel moeten instellen.

source: Hostname of the server (number: ${number})?
nl: Hostnaam van de server (nummer: ${number})?

source: Port on which the nbd-server is running (number: ${number})?
nl: Op welke poort draait de nbd-server (nummer: ${number})?

source: /dev entry for this nbd-client (number: ${number})?
nl: /dev ingang voor deze nbd-client (nummer: ${nummer})?

source: Every nbd-client process needs to be associated with a /dev entry with major number 43. Please enter the name of the /dev entry you want to use for this nbd-client. Note that this needs to be the full path to that entry, not just the last part.
nl: Elk nbd-client proces moet geassociëerd worden met een /dev ingang met major nummer 43. Gelieve de naam van de /dev ingang op te geven die je wilt gebruiken voor deze nbd-client. Merk op dat hier het volledige pad naar die ingang bedoeld wordt, en niet slechts het laatste deel.

source: If the /dev entry specified does not exist, it will be created with minor number ${number}.
nl: Wanneer deze ingang nog niet zou bestaan, zal hij aangemaakt worden met minor nummer ${number}

source: Disconnect all NBD devices on "stop"?
nl: Alle nbd-verbindingen verbreken bij 'stop'?

source: When the nbd-client init script is called to stop the nbd-client service, there are two things that can be done: either it can disconnect all nbd-client devices (which are assumed not to be in use), or it can disconnect only those nbd-client devices that it knows about in its config file.
nl: Wanneer het nbd-client initscript uitgevoerd wordt om de nbd-client service te stoppen, zijn er twee dingen die gedaan kunnen worden: ofwel kan het script alle nbd-client apparaten stoppen (waarbij er vanuit gegaan wordt dat ze niet in gebruik zijn), ofwel kan het enkel die apparaten stoppen waarvan het weet heeft via de configuratie.

source: The default (and the traditional behavior) is to disconnect all nbd-client devices. If the root device or other critical file systems are on NBD this will cause data loss and should not be accepted.
nl: Het standaard (en historisch) gedrag is om alle nbd-client verbindingen te verbreken. Als het root-apparaat of een ander kritiek bestandssysteem zich op een NBD bevindt, dan zal dit verlies van gegevens tot gevolg hebben en dus moet deze optie dan niet geaccepteerd worden.

source: Number of nbd-server instances to run:
nl: Aantal te draaien nbd-server instanties:

source: Multiple nbd-server processes may run to export multiple files or block devices. Please specify how many configurations for such servers you want to generate.
nl: U kan verschillende nbd-server processen uitvoeren, om verschillende bestanden of blok-apparaten te exporteren. Gelieve op te geven hoeveel nbd-server configuraties u dit configuratiescript wilt laten genereren

source: Note that you can always add extra servers by adding them to /etc/nbd-server/config, or by running "dpkg-reconfigure nbd-server".
nl: Merk op dat u altijd extra servers kan toevoegen door ze aan het bestand /etc/nbd-server/config toe te voegen, of door 'dpkg-reconfigure nbd-server' uit te voeren.

source: TCP Port for server number ${number}:
nl: TCP poort voor de server (nummer: ${number})?

source: Please specify the TCP port this instance of nbd server will use for listening. As NBD is likely to use more than one port, no dedicated port has been assigned in IANA lists.
nl: Gelieve de TCP poort op te geven waarnaar deze instantie van nbd-server zal luisteren. Vermits NBD gemakkelijk meer dan één poort gebruikt, werd geen poort toegewezen in de IANA-lijsten.

source: Therefore, NBD does not have a standard port number, which means you need to provide one. You should make sure this port is not already in use.
nl: Daarom heeft NBD geen standaard poortnummer, wat betekent dat je er zelf één moet opgeven. Zorg er voor dat het poortnummer dat je opgeeft nog niet in gebruik is.

source: File to export (server number ${number}):
nl: Te exporteren bestand (server nummer: ${number})?

source: Please specify a file name or block device that should be exported over the network. You can export a real block device (for instance "/dev/hda1"); a normal file (such as "/export/nbd/bl1"); or a bunch of files all at once. For the third option, you can use "%s" in the filename, which will be expanded to the IP-address of the connecting client. An example would be "/export/swaps/swp%s".
nl: Je moet hier een bestandnaam opgeven van een bestand of apparaatbestand welke je via het netwerk wilt exporteren. Je kunt ofwel een echt apparaatbestand exporteren (b.v. "/dev/hda1"), een normaal bestand exporteren (b.v. "/export/nbd/bl1"), of een hoop bestanden in één keer; voor de laatste optie kan je "%s" in de bestandnaam gebruiken, wat dan vervangen zal worden door het IP-adres van de client die probeert te connecteren. Een mogelijk voorbeeld is "/export/swaps/swp%s".

source: Note that it is possible to tune the way in which the IP address will be substituted in the file name. See "man 5 nbd-server" for details.
nl: Merk op dat het mogelijk is om de wijze waarop het IP-adres vervangen wordt in de bestandnaam, aan te passen. Zie "man 5 nbd-server" voor details.

source: AUTO_GEN is set to "n" in /etc/nbd-server
nl: AUTO_GEN staat op "n" in /etc/nbd-server

source: The /etc/nbd-server file contains a line that sets the AUTO_GEN variable to "n". The file will therefore not be regenerated automatically.
nl: Het bestand /etc/nbd-server bevat een lijn dat de AUTO_GEN variabele op "n" zet. Dit bestand zal daarom niet automatisch geregenereerd worden.

source: Note that the current version of the nbd-server package no longer uses /etc/nbd-server. Instead it uses a new configuration file, read by nbd-server itself (rather than the init script), which supports more options. See "man 5 nbd-server" for details.
nl: Merk op dat de huidige versie van het nbd-server pakket het bestand /etc/nbd-server niet langer ondersteunt. In de plaats daarvan gebruikt het een nieuwe stijl van configuratiebestand dat gelezen wordt door nbd-server zelf (in plaats van het init-script), en dat meer mogelijkheden heeft. Zie "man 5 nbd-server" voor details.

source: If you remove or comment out the AUTO_GEN line, a file /etc/nbd-server/config in the new format may be generated based on the current configuration. Until then, the nbd-server installation will be broken.
nl: Als u de AUTO_GEN lijn verwijdert of uitcommentarieert, dan kan een bestand /etc/nbd-server/config gegenereerd worden gebaseerd op uw huidige configuratie. Tot dan zal uw nbd-server installatie niet werken.

source: Convert old-style nbd-server configuration file?
nl: Het oude-stijl nbd-server configuratiebestand converteren?

source: A pre-2.9 nbd-server configuration file has been found on this system. The current nbd-server package no longer supports this file and will not work if it is kept as is.
nl: Een configuratiebestand voor nbd-server van voor versie 2.9 werd op dit systeem gevonden. De huidige versie van het nbd-server pakket ondersteunt dit bestand niet meer en zal zonder wijzigingen niet werken.

source: If you choose this option, the system will generate a new style configuration file based upon the old-style configuration file, which will be removed. Otherwise, configuration questions will be asked and the system will generate a new configuration file.
nl: Indien u deze optie accepteert, dan zal het systeem een nieuwe-stijl configuratiebestand aanmaken gebaseerd op het oude-stijl configuratiebestand, dat vervolgens verwijderd zal worden. In het andere geval zullen configuratievragen gesteld worden en zal het systeem een nieuw configuratiebestand genereren.

source: If a new-style configuration file already exists and you choose this option, you will shortly see a "modified configuration file" prompt, as usual.
nl: Als u reeds een nieuwe-stijl configuratiebestand hebt en u accepteert deze optie, dan zal u zodadelijk een "gewijzigd configuratiebestand"-prompt zien, zoals gewoonlijk.
